// Створити форму з трьома полями для name,surname,age та кнопкою. При натисканні на кнопку зчитати данні з полів, та вивести об'єкт в документ. Іншими словами : заповниои форму, натиснули кнопку, під формою з'явився блок з вашим об'єктом

let f1 = document.forms.f1

let mainDiv = document.createElement('div');
mainDiv.classList.add('mainDiv')

f1.onsubmit = function (ev) {
    ev.preventDefault()
    let NameSurnameAge = {
        Name: f1.name.value,
        Surname: f1.surname.value,
        Age: f1.age.value,
        toJSON() {
            return this.Name + ' - '.concat(this.Surname) + ' - '.concat(this.Age)
        },
    };
    let br = document.createElement('br');
    let divMain = document.createElement('div');
    divMain.classList.add('divInfo')
    divMain.innerText = JSON.parse(JSON.stringify(NameSurnameAge))
    mainDiv.append(f1, br, divMain)
    document.body.appendChild(mainDiv)
}

// ==========================
// є сторінка, на якій є блок, я кому знаходиьтся цифра. написати код, який при кожному перезавантажені сторінки буде додавати до неї +1


// ==========================
// Є сторінка index.html (назва довільна), при відвідуванні якої в локальне сховще, в масив sessions зберігається інформація про дату та час відвідування сторінки. Є ще сторінка sessions.html (назва довільна), при відвідуванні якої потрібно відмалювати всю інформацію про відвідування сторінки index.html. Інфу НЕ виводити в консоль, а побудувати дом структуру під кожну сессію
// =========================
//     зробити масив на 100 об'єктів та дві кнопки prev next
// при завантажені сторінки з'являються перші 10 об'єктів.
//     При натисканні next виводяться настпні 10 об'єктів
// При натисканні prev виводяться попередні 10 об'єктів
//
//
// *** Створити 3 інпута та кнопку. Один визначає кількість рядків, другий - кількість ячеєк, третій вмиіст ячеєк.
//     При натисканні кнопки, вся ця інформація зчитується і формується табличка, з відповідним вмістом.
// (Додатковачастина для завдання)